<a href="https://colab.research.google.com/github/jettysruthi8/perpinsta-internship/blob/main/W3P.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Week 3 (1)
data cleaning using pandas

In [2]:
import numpy as np
import pandas as pd

In [4]:
data = pd.read_csv("/content/sample_data/Data-cleaning-for-beginners-using-pandas.csv")
print(data)

    Index   Age      Salary  Rating       Location  Established Easy Apply
0       0  44.0   $44k-$99k     5.4       India,In         1999       TRUE
1       1  66.0   $55k-$66k     3.5    New York,Ny         2002       TRUE
2       2   NaN   $77k-$89k    -1.0    New York,Ny           -1         -1
3       3  64.0   $44k-$99k     4.4       India In         1988         -1
4       4  25.0   $44k-$99k     6.4  Australia Aus         2002         -1
5       5  44.0   $77k-$89k     1.4       India,In         1999       TRUE
6       6  21.0   $44k-$99k     0.0    New York,Ny           -1         -1
7       7  44.0   $44k-$99k    -1.0  Australia Aus           -1         -1
8       8  35.0   $44k-$99k     5.4    New York,Ny           -1         -1
9       9  22.0   $44k-$99k     7.7       India,In           -1       TRUE
10     10  55.0   $10k-$49k     5.4       India,In         2008       TRUE
11     11  44.0   $10k-$49k     6.7       India,In         2009         -1
12     12   NaN   $44k-$99k     0.0       India,In         1999         -1
13     13  25.0   $44k-$99k    -1.0  Australia Aus         2019       TRUE
14     14  66.0   $44k-$99k     4.0  Australia Aus         2020       TRUE
15     15  44.0  $88k-$101k     3.0  Australia Aus         1999         -1
16     16  19.0   $19k-$40k     4.5       India,In         1984         -1
17     17   NaN   $44k-$99k     5.3    New York,Ny         1943       TRUE
18     18  35.0   $44k-$99k     6.7    New York,Ny         1954       TRUE
19     19  32.0   $44k-$99k     3.3    New York,Ny         1955       TRUE
20     20   NaN   $44k-$99k     5.7    New York,Ny         1944       TRUE
21     21  35.0   $44k-$99k     5.0    New York,Ny         1946         -1
22     22  19.0   $55k-$66k     7.8    New York,Ny         1988       TRUE
23     23   NaN   $44k-$99k     2.4    New York,Ny         1999       TRUE
24     24  13.0   $44k-$99k    -1.0    New York,Ny         1987         -1
25     25  55.0   $44k-$99k     0.0  Australia Aus         1980       TRUE
26     26   NaN   $55k-$66k     NaN       India,In         1934       TRUE
27     27  52.0   $44k-$99k     5.4       India,In         1935         -1
28     28   NaN   $39k-$88k     3.4  Australia Aus         1932         -1

1) Missing Values: Are there any missing values in the dataset, and if so, how should they be handled for each indicator?

In [5]:
data.isnull().sum()

Index          0
Age            7
Salary         0
Rating         1
Location       0
Established    0
Easy Apply     0
dtype: int64

In [6]:
data.isnull().sum().sum()

8

In [7]:
data.Age.fillna(data.Age.mean(),inplace = True)
print(data)

    Index        Age      Salary  Rating       Location  Established  \
0       0  44.000000   $44k-$99k     5.4       India,In         1999
1       1  66.000000   $55k-$66k     3.5    New York,Ny         2002
2       2  39.045455   $77k-$89k    -1.0    New York,Ny           -1
3       3  64.000000   $44k-$99k     4.4       India In         1988
4       4  25.000000   $44k-$99k     6.4  Australia Aus         2002
5       5  44.000000   $77k-$89k     1.4       India,In         1999
6       6  21.000000   $44k-$99k     0.0    New York,Ny           -1
7       7  44.000000   $44k-$99k    -1.0  Australia Aus           -1
8       8  35.000000   $44k-$99k     5.4    New York,Ny           -1
9       9  22.000000   $44k-$99k     7.7       India,In           -1
10     10  55.000000   $10k-$49k     5.4       India,In         2008
11     11  44.000000   $10k-$49k     6.7       India,In         2009
12     12  39.045455   $44k-$99k     0.0       India,In         1999
13     13  25.000000   $44k-$99k    -1.0  Australia Aus         2019
14     14  66.000000   $44k-$99k     4.0  Australia Aus         2020
15     15  44.000000  $88k-$101k     3.0  Australia Aus         1999
16     16  19.000000   $19k-$40k     4.5       India,In         1984
17     17  39.045455   $44k-$99k     5.3    New York,Ny         1943
18     18  35.000000   $44k-$99k     6.7    New York,Ny         1954
19     19  32.000000   $44k-$99k     3.3    New York,Ny         1955
20     20  39.045455   $44k-$99k     5.7    New York,Ny         1944
21     21  35.000000   $44k-$99k     5.0    New York,Ny         1946
22     22  19.000000   $55k-$66k     7.8    New York,Ny         1988
23     23  39.045455   $44k-$99k     2.4    New York,Ny         1999
24     24  13.000000   $44k-$99k    -1.0    New York,Ny         1987
25     25  55.000000   $44k-$99k     0.0  Australia Aus         1980
26     26  39.045455   $55k-$66k     NaN       India,In         1934
27     27  52.000000   $44k-$99k     5.4       India,In         1935
28     28  39.045455   $39k-$88k     3.4  Australia Aus         1932

   Easy Apply
0        TRUE
1        TRUE
2          -1
3          -1
4          -1
5        TRUE
6          -1
7          -1
8          -1
9        TRUE
10       TRUE
11         -1
12         -1
13       TRUE
14       TRUE
15         -1
16         -1
17       TRUE
18       TRUE
19       TRUE
20       TRUE
21         -1
22       TRUE
23       TRUE
24         -1
25       TRUE
26       TRUE
27         -1
28         -1

In [8]:
data['Age'] = data.Age.round(decimals=0)

In [9]:
data['Age'] = data['Age'].astype(int)

In [10]:
print(data)

    Index  Age      Salary  Rating       Location  Established Easy Apply
0       0   44   $44k-$99k     5.4       India,In         1999       TRUE
1       1   66   $55k-$66k     3.5    New York,Ny         2002       TRUE
2       2   39   $77k-$89k    -1.0    New York,Ny           -1         -1
3       3   64   $44k-$99k     4.4       India In         1988         -1
4       4   25   $44k-$99k     6.4  Australia Aus         2002         -1
5       5   44   $77k-$89k     1.4       India,In         1999       TRUE
6       6   21   $44k-$99k     0.0    New York,Ny           -1         -1
7       7   44   $44k-$99k    -1.0  Australia Aus           -1         -1
8       8   35   $44k-$99k     5.4    New York,Ny           -1         -1
9       9   22   $44k-$99k     7.7       India,In           -1       TRUE
10     10   55   $10k-$49k     5.4       India,In         2008       TRUE
11     11   44   $10k-$49k     6.7       India,In         2009         -1
12     12   39   $44k-$99k     0.0       India,In         1999         -1
13     13   25   $44k-$99k    -1.0  Australia Aus         2019       TRUE
14     14   66   $44k-$99k     4.0  Australia Aus         2020       TRUE
15     15   44  $88k-$101k     3.0  Australia Aus         1999         -1
16     16   19   $19k-$40k     4.5       India,In         1984         -1
17     17   39   $44k-$99k     5.3    New York,Ny         1943       TRUE
18     18   35   $44k-$99k     6.7    New York,Ny         1954       TRUE
19     19   32   $44k-$99k     3.3    New York,Ny         1955       TRUE
20     20   39   $44k-$99k     5.7    New York,Ny         1944       TRUE
21     21   35   $44k-$99k     5.0    New York,Ny         1946         -1
22     22   19   $55k-$66k     7.8    New York,Ny         1988       TRUE
23     23   39   $44k-$99k     2.4    New York,Ny         1999       TRUE
24     24   13   $44k-$99k    -1.0    New York,Ny         1987         -1
25     25   55   $44k-$99k     0.0  Australia Aus         1980       TRUE
26     26   39   $55k-$66k     NaN       India,In         1934       TRUE
27     27   52   $44k-$99k     5.4       India,In         1935         -1
28     28   39   $39k-$88k     3.4  Australia Aus         1932         -1

In [11]:
data.Rating.fillna(data.Rating.mean(),inplace=True)
print(data)

    Index  Age      Salary    Rating       Location  Established Easy Apply
0       0   44   $44k-$99k  5.400000       India,In         1999       TRUE
1       1   66   $55k-$66k  3.500000    New York,Ny         2002       TRUE
2       2   39   $77k-$89k -1.000000    New York,Ny           -1         -1
3       3   64   $44k-$99k  4.400000       India In         1988         -1
4       4   25   $44k-$99k  6.400000  Australia Aus         2002         -1
5       5   44   $77k-$89k  1.400000       India,In         1999       TRUE
6       6   21   $44k-$99k  0.000000    New York,Ny           -1         -1
7       7   44   $44k-$99k -1.000000  Australia Aus           -1         -1
8       8   35   $44k-$99k  5.400000    New York,Ny           -1         -1
9       9   22   $44k-$99k  7.700000       India,In           -1       TRUE
10     10   55   $10k-$49k  5.400000       India,In         2008       TRUE
11     11   44   $10k-$49k  6.700000       India,In         2009         -1
12     12   39   $44k-$99k  0.000000       India,In         1999         -1
13     13   25   $44k-$99k -1.000000  Australia Aus         2019       TRUE
14     14   66   $44k-$99k  4.000000  Australia Aus         2020       TRUE
15     15   44  $88k-$101k  3.000000  Australia Aus         1999         -1
16     16   19   $19k-$40k  4.500000       India,In         1984         -1
17     17   39   $44k-$99k  5.300000    New York,Ny         1943       TRUE
18     18   35   $44k-$99k  6.700000    New York,Ny         1954       TRUE
19     19   32   $44k-$99k  3.300000    New York,Ny         1955       TRUE
20     20   39   $44k-$99k  5.700000    New York,Ny         1944       TRUE
21     21   35   $44k-$99k  5.000000    New York,Ny         1946         -1
22     22   19   $55k-$66k  7.800000    New York,Ny         1988       TRUE
23     23   39   $44k-$99k  2.400000    New York,Ny         1999       TRUE
24     24   13   $44k-$99k -1.000000    New York,Ny         1987         -1
25     25   55   $44k-$99k  0.000000  Australia Aus         1980       TRUE
26     26   39   $55k-$66k  3.528571       India,In         1934       TRUE
27     27   52   $44k-$99k  5.400000       India,In         1935         -1
28     28   39   $39k-$88k  3.400000  Australia Aus         1932         -1

In [12]:
data['Rating'] = data.Rating.round(decimals = 0)
print(data)

    Index  Age      Salary  Rating       Location  Established Easy Apply
0       0   44   $44k-$99k     5.0       India,In         1999       TRUE
1       1   66   $55k-$66k     4.0    New York,Ny         2002       TRUE
2       2   39   $77k-$89k    -1.0    New York,Ny           -1         -1
3       3   64   $44k-$99k     4.0       India In         1988         -1
4       4   25   $44k-$99k     6.0  Australia Aus         2002         -1
5       5   44   $77k-$89k     1.0       India,In         1999       TRUE
6       6   21   $44k-$99k     0.0    New York,Ny           -1         -1
7       7   44   $44k-$99k    -1.0  Australia Aus           -1         -1
8       8   35   $44k-$99k     5.0    New York,Ny           -1         -1
9       9   22   $44k-$99k     8.0       India,In           -1       TRUE
10     10   55   $10k-$49k     5.0       India,In         2008       TRUE
11     11   44   $10k-$49k     7.0       India,In         2009         -1
12     12   39   $44k-$99k     0.0       India,In         1999         -1
13     13   25   $44k-$99k    -1.0  Australia Aus         2019       TRUE
14     14   66   $44k-$99k     4.0  Australia Aus         2020       TRUE
15     15   44  $88k-$101k     3.0  Australia Aus         1999         -1
16     16   19   $19k-$40k     4.0       India,In         1984         -1
17     17   39   $44k-$99k     5.0    New York,Ny         1943       TRUE
18     18   35   $44k-$99k     7.0    New York,Ny         1954       TRUE
19     19   32   $44k-$99k     3.0    New York,Ny         1955       TRUE
20     20   39   $44k-$99k     6.0    New York,Ny         1944       TRUE
21     21   35   $44k-$99k     5.0    New York,Ny         1946         -1
22     22   19   $55k-$66k     8.0    New York,Ny         1988       TRUE
23     23   39   $44k-$99k     2.0    New York,Ny         1999       TRUE
24     24   13   $44k-$99k    -1.0    New York,Ny         1987         -1
25     25   55   $44k-$99k     0.0  Australia Aus         1980       TRUE
26     26   39   $55k-$66k     4.0       India,In         1934       TRUE
27     27   52   $44k-$99k     5.0       India,In         1935         -1
28     28   39   $39k-$88k     3.0  Australia Aus         1932         -1

2)Data Types: What are the data types of each indicator, and do they align with their expected types?

In [13]:
print(data.dtypes)

Index            int64
Age              int64
Salary          object
Rating         float64
Location        object
Established      int64
Easy Apply      object
dtype: object

In [14]:
data_types = data.dtypes

for column, dtype in  data_types.items():
  print(f"{column}: {dtype}")

  if data[column].dtype =='object':
    print(f"Expected Type: Categorical")
  elif data[column].dtype == 'float64':
    print(f"Expected Type: Numerical")

  print()

Index: int64

Age: int64

Salary: object
Expected Type: Categorical

Rating: float64
Expected Type: Numerical

Location: object
Expected Type: Categorical

Established: int64

Easy Apply: object
Expected Type: Categorical

4). Salary Formatting: Examine the format of the Salary column. Does it require any formatting or standardization for consistent analysis?

In [15]:
data['Salary']

0      $44k-$99k
1      $55k-$66k
2      $77k-$89k
3      $44k-$99k
4      $44k-$99k
5      $77k-$89k
6      $44k-$99k
7      $44k-$99k
8      $44k-$99k
9      $44k-$99k
10     $10k-$49k
11     $10k-$49k
12     $44k-$99k
13     $44k-$99k
14     $44k-$99k
15    $88k-$101k
16     $19k-$40k
17     $44k-$99k
18     $44k-$99k
19     $44k-$99k
20     $44k-$99k
21     $44k-$99k
22     $55k-$66k
23     $44k-$99k
24     $44k-$99k
25     $44k-$99k
26     $55k-$66k
27     $44k-$99k
28     $39k-$88k
Name: Salary, dtype: object

In [16]:
data.Salary = data.Salary.str.replace('$'," ")

<ipython-input-16-00504c136468>:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  data.Salary = data.Salary.str.replace('$'," ")

In [17]:
data.Salary = data.Salary.str.replace("k","000")

In [18]:
data.Salary = data.Salary.str.replace("-"," -")

In [19]:
data.Salary = data.Salary.replace("88000"," 88000")

In [20]:
data['Salary'] = data['Salary'].str.replace(r'\s*-\s*', '-')

<ipython-input-20-465fe4944133>:1: FutureWarning: The default value of regex will change from True to False in a future version.
  data['Salary'] = data['Salary'].str.replace(r'\s*-\s*', '-')

In [21]:
data['Easy Apply'] = data['Easy Apply'].str.strip()

In [22]:
print(data)

    Index  Age         Salary  Rating       Location  Established Easy Apply
0       0   44    44000-99000     5.0       India,In         1999       TRUE
1       1   66    55000-66000     4.0    New York,Ny         2002       TRUE
2       2   39    77000-89000    -1.0    New York,Ny           -1         -1
3       3   64    44000-99000     4.0       India In         1988         -1
4       4   25    44000-99000     6.0  Australia Aus         2002         -1
5       5   44    77000-89000     1.0       India,In         1999       TRUE
6       6   21    44000-99000     0.0    New York,Ny           -1         -1
7       7   44    44000-99000    -1.0  Australia Aus           -1         -1
8       8   35    44000-99000     5.0    New York,Ny           -1         -1
9       9   22    44000-99000     8.0       India,In           -1       TRUE
10     10   55    10000-49000     5.0       India,In         2008       TRUE
11     11   44    10000-49000     7.0       India,In         2009         -1
12     12   39    44000-99000     0.0       India,In         1999         -1
13     13   25    44000-99000    -1.0  Australia Aus         2019       TRUE
14     14   66    44000-99000     4.0  Australia Aus         2020       TRUE
15     15   44   88000-101000     3.0  Australia Aus         1999         -1
16     16   19    19000-40000     4.0       India,In         1984         -1
17     17   39    44000-99000     5.0    New York,Ny         1943       TRUE
18     18   35    44000-99000     7.0    New York,Ny         1954       TRUE
19     19   32    44000-99000     3.0    New York,Ny         1955       TRUE
20     20   39    44000-99000     6.0    New York,Ny         1944       TRUE
21     21   35    44000-99000     5.0    New York,Ny         1946         -1
22     22   19    55000-66000     8.0    New York,Ny         1988       TRUE
23     23   39    44000-99000     2.0    New York,Ny         1999       TRUE
24     24   13    44000-99000    -1.0    New York,Ny         1987         -1
25     25   55    44000-99000     0.0  Australia Aus         1980       TRUE
26     26   39    55000-66000     4.0       India,In         1934       TRUE
27     27   52    44000-99000     5.0       India,In         1935         -1
28     28   39    39000-88000     3.0  Australia Aus         1932         -1

5) Location Standardization: Check the consistency of location entries. Do they need standardization, and how can this be achieved?

In [23]:
data.Location = data.Location.str.replace(',In',' ')
data.Location = data.Location.str.replace(' In',' ')
data.Location = data.Location.str.replace('Australia Aus','Australia')
data.Location = data.Location.str.replace(',Ny',' ')

In [24]:
print(data)

    Index  Age         Salary  Rating   Location  Established Easy Apply
0       0   44    44000-99000     5.0     India          1999       TRUE
1       1   66    55000-66000     4.0  New York          2002       TRUE
2       2   39    77000-89000    -1.0  New York            -1         -1
3       3   64    44000-99000     4.0     India          1988         -1
4       4   25    44000-99000     6.0  Australia         2002         -1
5       5   44    77000-89000     1.0     India          1999       TRUE
6       6   21    44000-99000     0.0  New York            -1         -1
7       7   44    44000-99000    -1.0  Australia           -1         -1
8       8   35    44000-99000     5.0  New York            -1         -1
9       9   22    44000-99000     8.0     India            -1       TRUE
10     10   55    10000-49000     5.0     India          2008       TRUE
11     11   44    10000-49000     7.0     India          2009         -1
12     12   39    44000-99000     0.0     India          1999         -1
13     13   25    44000-99000    -1.0  Australia         2019       TRUE
14     14   66    44000-99000     4.0  Australia         2020       TRUE
15     15   44   88000-101000     3.0  Australia         1999         -1
16     16   19    19000-40000     4.0     India          1984         -1
17     17   39    44000-99000     5.0  New York          1943       TRUE
18     18   35    44000-99000     7.0  New York          1954       TRUE
19     19   32    44000-99000     3.0  New York          1955       TRUE
20     20   39    44000-99000     6.0  New York          1944       TRUE
21     21   35    44000-99000     5.0  New York          1946         -1
22     22   19    55000-66000     8.0  New York          1988       TRUE
23     23   39    44000-99000     2.0  New York          1999       TRUE
24     24   13    44000-99000    -1.0  New York          1987         -1
25     25   55    44000-99000     0.0  Australia         1980       TRUE
26     26   39    55000-66000     4.0     India          1934       TRUE
27     27   52    44000-99000     5.0     India          1935         -1
28     28   39    39000-88000     3.0  Australia         1932         -1

6) Established Column: Explore the Established column. Are there any inconsistencies or anomalies that need to be addressed?

In [25]:
data['Established'].replace(-1, 'Unknown',inplace = True)

In [26]:
print(data)

    Index  Age         Salary  Rating   Location Established Easy Apply
0       0   44    44000-99000     5.0     India         1999       TRUE
1       1   66    55000-66000     4.0  New York         2002       TRUE
2       2   39    77000-89000    -1.0  New York      Unknown         -1
3       3   64    44000-99000     4.0     India         1988         -1
4       4   25    44000-99000     6.0  Australia        2002         -1
5       5   44    77000-89000     1.0     India         1999       TRUE
6       6   21    44000-99000     0.0  New York      Unknown         -1
7       7   44    44000-99000    -1.0  Australia     Unknown         -1
8       8   35    44000-99000     5.0  New York      Unknown         -1
9       9   22    44000-99000     8.0     India      Unknown       TRUE
10     10   55    10000-49000     5.0     India         2008       TRUE
11     11   44    10000-49000     7.0     India         2009         -1
12     12   39    44000-99000     0.0     India         1999         -1
13     13   25    44000-99000    -1.0  Australia        2019       TRUE
14     14   66    44000-99000     4.0  Australia        2020       TRUE
15     15   44   88000-101000     3.0  Australia        1999         -1
16     16   19    19000-40000     4.0     India         1984         -1
17     17   39    44000-99000     5.0  New York         1943       TRUE
18     18   35    44000-99000     7.0  New York         1954       TRUE
19     19   32    44000-99000     3.0  New York         1955       TRUE
20     20   39    44000-99000     6.0  New York         1944       TRUE
21     21   35    44000-99000     5.0  New York         1946         -1
22     22   19    55000-66000     8.0  New York         1988       TRUE
23     23   39    44000-99000     2.0  New York         1999       TRUE
24     24   13    44000-99000    -1.0  New York         1987         -1
25     25   55    44000-99000     0.0  Australia        1980       TRUE
26     26   39    55000-66000     4.0     India         1934       TRUE
27     27   52    44000-99000     5.0     India         1935         -1
28     28   39    39000-88000     3.0  Australia        1932         -1

7) Easy Apply Indicator: Analyze the Easy Apply column. Does it contain boolean values or need transformation for better analysis?

In [27]:
data['Easy Apply'] = data['Easy Apply'].str.replace('-1',"FALSE")

In [28]:
print(data)

    Index  Age         Salary  Rating   Location Established Easy Apply
0       0   44    44000-99000     5.0     India         1999       TRUE
1       1   66    55000-66000     4.0  New York         2002       TRUE
2       2   39    77000-89000    -1.0  New York      Unknown      FALSE
3       3   64    44000-99000     4.0     India         1988      FALSE
4       4   25    44000-99000     6.0  Australia        2002      FALSE
5       5   44    77000-89000     1.0     India         1999       TRUE
6       6   21    44000-99000     0.0  New York      Unknown      FALSE
7       7   44    44000-99000    -1.0  Australia     Unknown      FALSE
8       8   35    44000-99000     5.0  New York      Unknown      FALSE
9       9   22    44000-99000     8.0     India      Unknown       TRUE
10     10   55    10000-49000     5.0     India         2008       TRUE
11     11   44    10000-49000     7.0     India         2009      FALSE
12     12   39    44000-99000     0.0     India         1999      FALSE
13     13   25    44000-99000    -1.0  Australia        2019       TRUE
14     14   66    44000-99000     4.0  Australia        2020       TRUE
15     15   44   88000-101000     3.0  Australia        1999      FALSE
16     16   19    19000-40000     4.0     India         1984      FALSE
17     17   39    44000-99000     5.0  New York         1943       TRUE
18     18   35    44000-99000     7.0  New York         1954       TRUE
19     19   32    44000-99000     3.0  New York         1955       TRUE
20     20   39    44000-99000     6.0  New York         1944       TRUE
21     21   35    44000-99000     5.0  New York         1946      FALSE
22     22   19    55000-66000     8.0  New York         1988       TRUE
23     23   39    44000-99000     2.0  New York         1999       TRUE
24     24   13    44000-99000    -1.0  New York         1987      FALSE
25     25   55    44000-99000     0.0  Australia        1980       TRUE
26     26   39    55000-66000     4.0     India         1934       TRUE
27     27   52    44000-99000     5.0     India         1935      FALSE
28     28   39    39000-88000     3.0  Australia        1932      FALSE

9) Age Distribution:Check the distribution of values in the Age column. Are there any unusual entries, and how might they impact analysis?

In [29]:
data.Age.info()

<class 'pandas.core.series.Series'>
RangeIndex: 29 entries, 0 to 28
Series name: Age
Non-Null Count  Dtype
--------------  -----
29 non-null     int64
dtypes: int64(1)
memory usage: 360.0 bytes

In [30]:
data.Age.describe()

count    29.000000
mean     39.034483
std      13.973145
min      13.000000
25%      32.000000
50%      39.000000
75%      44.000000
max      66.000000
Name: Age, dtype: float64

10) Handling Special Characters: Examine all text-based columns (e.g., Location). Are there special characters or inconsistencies that need cleaning?

In [31]:
text_columns = ['Location', 'Easy Apply']

for columns in text_columns:
  unique_values = data[column].unique()
  print(f"Unique values in {column}:")
  print(unique_values)

  for value in unique_values:
    if pd.notna(value) and any(char.isalnum() or char.isspace() for char in value):
      print(f"Special characters found in '{value}' of column '{column}'")

Unique values in Easy Apply:
['TRUE' 'FALSE']
Special characters found in 'TRUE' of column 'Easy Apply'
Special characters found in 'FALSE' of column 'Easy Apply'
Unique values in Easy Apply:
['TRUE' 'FALSE']
Special characters found in 'TRUE' of column 'Easy Apply'
Special characters found in 'FALSE' of column 'Easy Apply'

In [32]:
print(data)

    Index  Age         Salary  Rating   Location Established Easy Apply
0       0   44    44000-99000     5.0     India         1999       TRUE
1       1   66    55000-66000     4.0  New York         2002       TRUE
2       2   39    77000-89000    -1.0  New York      Unknown      FALSE
3       3   64    44000-99000     4.0     India         1988      FALSE
4       4   25    44000-99000     6.0  Australia        2002      FALSE
5       5   44    77000-89000     1.0     India         1999       TRUE
6       6   21    44000-99000     0.0  New York      Unknown      FALSE
7       7   44    44000-99000    -1.0  Australia     Unknown      FALSE
8       8   35    44000-99000     5.0  New York      Unknown      FALSE
9       9   22    44000-99000     8.0     India      Unknown       TRUE
10     10   55    10000-49000     5.0     India         2008       TRUE
11     11   44    10000-49000     7.0     India         2009      FALSE
12     12   39    44000-99000     0.0     India         1999      FALSE
13     13   25    44000-99000    -1.0  Australia        2019       TRUE
14     14   66    44000-99000     4.0  Australia        2020       TRUE
15     15   44   88000-101000     3.0  Australia        1999      FALSE
16     16   19    19000-40000     4.0     India         1984      FALSE
17     17   39    44000-99000     5.0  New York         1943       TRUE
18     18   35    44000-99000     7.0  New York         1954       TRUE
19     19   32    44000-99000     3.0  New York         1955       TRUE
20     20   39    44000-99000     6.0  New York         1944       TRUE
21     21   35    44000-99000     5.0  New York         1946      FALSE
22     22   19    55000-66000     8.0  New York         1988       TRUE
23     23   39    44000-99000     2.0  New York         1999       TRUE
24     24   13    44000-99000    -1.0  New York         1987      FALSE
25     25   55    44000-99000     0.0  Australia        1980       TRUE
26     26   39    55000-66000     4.0     India         1934       TRUE
27     27   52    44000-99000     5.0     India         1935      FALSE
28     28   39    39000-88000     3.0  Australia        1932      FALSE